Tekla.Structures.ModelInternal.InputGeometryEvents
The InputGeometryEvents class allows the user to register event listeners for input geometry events.
Remarks:
Asynchronous event handling
Registered event handlers are called asynchronously so that many handlers may be running
simultaneously. Event handlers are not guaranteed to be run in the same thread where they were registered.
The asynchronous nature of the events requires the use of synchronization constructs on objects
and data structures that are not defined to be thread safe.
Microsoft's documentation about the lock statement: http://msdn.microsoft.com/en-us/library/c5kehkcz.aspx
Microsoft's documentation about delegates: http://msdn.microsoft.com/en-us/library/900fyy8e.aspx
Microsoft's documentation about managed threading: http://msdn.microsoft.com/en-us/library/1c9txz50.aspx
The following example shows how to make sure that only one selection event handler is running at a time.
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
using Tekla.Structures.ModelInternal;
public class Example
{
private InputGeometryEvents _events = new InputGeometryEvents();
private object _changedObjectHandlerLock = new object();
public void RegisterEventHandler()
{
_events.PointInputChanged += Events_OnputObjectChangedEvent;
_events.Register();
}
public void UnRegisterEventHandler()
{
_events.UnRegister();
}
void Events_OnputObjectChangedEvent(List<Point> changes)
{
/* Make sure that the inner code block is running synchronously */
lock (_changedObjectHandlerLock)
{
foreach(Point data in changes)
System.Console.WriteLine("Changed point received " + ":" + data.ToString());
}
}
}

Tekla.Structures.ModelInternal.InputGeometryEvents.ClientID
The ClienID

Tekla.Structures.ModelInternal.InputGeometryEvents.PointInputChanged
The PointInputChanged event is raised when the user changes the input geometry ins Tekla Structures view.

Tekla.Structures.ModelInternal.InputGeometryEvents.OnPointInputChangedEvent(System.String,System.Object[])


Tekla.Structures.ModelInternal.InputGeometryEvents.InitializeLifetimeService
Initializes the lifetime service.
Returns: Always null.

Tekla.Structures.ModelInternal.InputGeometryEvents.#ctor
Creates an empty events instance.

Tekla.Structures.ModelInternal.InputGeometryEvents.Register
Registers the instance to listen to the specified events.
More event delegates should not be added without calling UnRegister
first.

Tekla.Structures.ModelInternal.InputGeometryEvents.UnRegister
Unregisters the instance from listening to events.